/*  В рамках лабораторной работы разрешено использование STL-контейнеров,
 *  а также классов и функций из заголовочных файлов <memory>, <iterator>, <functional>, <algorithm> и <numeric>.
 *  Запрещено использование функций ручного управления памятью (malloc, free, new и delete).
 *  Работу с памятью делегировать STL-контейнерам и «умным указателям» std::uniqie_ptr/std::shared_ptr.
 *
 *  Нужно написать:
 *  1) Класс Graph
 *  2) Демонстрационная программа:
 *      Пусть дан связный граф, в котором узлы – это торговые точки.
 *      Необходимо превратить одну из торговых точек в склад.
 *      Цена доставки от склада в точку зависит от расстояния.
 *      Найдите оптимальную с точки зрения максимальных затрат точку (т.е. точку,
 *      для которой максимальное расстояние до любой другой точки минимально).
 */

#include <iostream>

int main() {

    return 0;
}
